---
type: AlphanumericRevisionSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# AlphanumericRevisionSettings

`Autodesk.Revit.DB.AlphanumericRevisionSettings` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AlphanumericRevisionSettings | — | `` |
| Constructor | AlphanumericRevisionSettings | 2016 | `public AlphanumericRevisionSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSequence | 2016 | `public IList < string > GetSequence ()` |
| Method | IsEqual | 2016 | `public bool IsEqual ( AlphanumericRevisionSettings other )` |
| Method | IsValid | 2016 | `public bool IsValid ()` |
| Method | SetSequence | 2016 | `public void SetSequence ( IList < string > sequence )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Prefix | 2016 | `public string Prefix { get ; set ; }` |
| Property | Suffix | 2016 | `public string Suffix { get ; set ; }` |